attachments/28005/win-agent.txt

No.     Time        Source                Destination           Protocol Length Info
      1 0.000000    10.124.9.245          10.124.9.246          TCP      74     56648 > wsman [SYN] Seq=0 Win=29200 Len=0 MSS=1460 SACK_PERM=1 TSval=86219229 TSecr=0 WS=128

Frame 1: 74 bytes on wire (592 bits), 74 bytes captured (592 bits)
Ethernet II, Src: 12:be:ae:14:b6:c8 (12:be:ae:14:b6:c8), Dst: 12:9d:74:ee:f8:75 (12:9d:74:ee:f8:75)
Internet Protocol Version 4, Src: 10.124.9.245 (10.124.9.245), Dst: 10.124.9.246 (10.124.9.246)
Transmission Control Protocol, Src Port: 56648 (56648), Dst Port: wsman (5985), Seq: 0, Len: 0

No.     Time        Source                Destination           Protocol Length Info
      2 0.000590    10.124.9.246          10.124.9.245          TCP      74     wsman > 56648 [SYN, ACK] Seq=0 Ack=1 Win=8192 Len=0 MSS=1460 WS=256 SACK_PERM=1 TSval=23667722 TSecr=86219229

Frame 2: 74 bytes on wire (592 bits), 74 bytes captured (592 bits)
Ethernet II, Src: 12:9d:74:ee:f8:75 (12:9d:74:ee:f8:75), Dst: 12:be:ae:14:b6:c8 (12:be:ae:14:b6:c8)
Internet Protocol Version 4, Src: 10.124.9.246 (10.124.9.246), Dst: 10.124.9.245 (10.124.9.245)
Transmission Control Protocol, Src Port: wsman (5985), Dst Port: 56648 (56648), Seq: 0, Ack: 1, Len: 0

No.     Time        Source                Destination           Protocol Length Info
      3 0.000627    10.124.9.245          10.124.9.246          TCP      66     56648 > wsman [ACK] Seq=1 Ack=1 Win=29312 Len=0 TSval=86219229 TSecr=23667722

Frame 3: 66 bytes on wire (528 bits), 66 bytes captured (528 bits)
Ethernet II, Src: 12:be:ae:14:b6:c8 (12:be:ae:14:b6:c8), Dst: 12:9d:74:ee:f8:75 (12:9d:74:ee:f8:75)
Internet Protocol Version 4, Src: 10.124.9.245 (10.124.9.245), Dst: 10.124.9.246 (10.124.9.246)
Transmission Control Protocol, Src Port: 56648 (56648), Dst Port: wsman (5985), Seq: 1, Ack: 1, Len: 0

No.     Time        Source                Destination           Protocol Length Info
      4 0.000937    10.124.9.245          10.124.9.246          TCP      258    [TCP segment of a reassembled PDU]

Frame 4: 258 bytes on wire (2064 bits), 258 bytes captured (2064 bits)
Ethernet II, Src: 12:be:ae:14:b6:c8 (12:be:ae:14:b6:c8), Dst: 12:9d:74:ee:f8:75 (12:9d:74:ee:f8:75)
Internet Protocol Version 4, Src: 10.124.9.245 (10.124.9.245), Dst: 10.124.9.246 (10.124.9.246)
Transmission Control Protocol, Src Port: 56648 (56648), Dst Port: wsman (5985), Seq: 1, Ack: 1, Len: 192

No.     Time        Source                Destination           Protocol Length Info
      5 0.001046    10.124.9.245          10.124.9.246          HTTP/XML 1386   POST /wsman HTTP/1.1 

Frame 5: 1386 bytes on wire (11088 bits), 1386 bytes captured (11088 bits)
Ethernet II, Src: 12:be:ae:14:b6:c8 (12:be:ae:14:b6:c8), Dst: 12:9d:74:ee:f8:75 (12:9d:74:ee:f8:75)
Internet Protocol Version 4, Src: 10.124.9.245 (10.124.9.245), Dst: 10.124.9.246 (10.124.9.246)
Transmission Control Protocol, Src Port: 56648 (56648), Dst Port: wsman (5985), Seq: 193, Ack: 1, Len: 1320
[2 Reassembled TCP Segments (1512 bytes): #4(192), #5(1320)]
Hypertext Transfer Protocol
eXtensible Markup Language
    <?xml
        version="1.0"
        encoding="UTF-8"
        ?>
    <env:Envelope
        xmlns:env="http://www.w3.org/2003/05/soap-envelope"
        xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
        xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"
        xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
        xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <env:Header>
            <a:To>
                http://10.124.9.246:5985/wsman
                </a:To>
            <a:ReplyTo>
                <a:Address
                    mustUnderstand="true">
                    http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
                    </a:Address>
                </a:ReplyTo>
            <w:MaxEnvelopeSize
                mustUnderstand="true">
                153600
                </w:MaxEnvelopeSize>
            <a:MessageID>
                uuid:6E34D70C-BE02-4422-8B27-6ADD7F1D3623
                </a:MessageID>
            <w:Locale
                mustUnderstand="false"
                xml:lang="en-US"/>
            <p:DataLocale
                mustUnderstand="false"
                xml:lang="en-US"/>
            <w:OperationTimeout>
                PT60S
                </w:OperationTimeout>
            <a:Action
                mustUnderstand="true">
                http://schemas.xmlsoap.org/ws/2004/09/transfer/Create
                </a:Action>
            <w:ResourceURI
                mustUnderstand="true">
                http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd
                </w:ResourceURI>
            <w:OptionSet>
                <w:Option
                    Name="WINRS_NOPROFILE">
                    FALSE
                    </w:Option>
                <w:Option
                    Name="WINRS_CODEPAGE">
                    437
                    </w:Option>
                </w:OptionSet>
            </env:Header>
        <env:Body>
            <rsp:Shell>
                <rsp:InputStreams>
                    stdin
                    </rsp:InputStreams>
                <rsp:OutputStreams>
                    stdout stderr
                    </rsp:OutputStreams>
                </rsp:Shell>
            </env:Body>
        </env:Envelope>

No.     Time        Source                Destination           Protocol Length Info
      6 0.001407    10.124.9.246          10.124.9.245          HTTP     257    HTTP/1.1 401  

Frame 6: 257 bytes on wire (2056 bits), 257 bytes captured (2056 bits)
Ethernet II, Src: 12:9d:74:ee:f8:75 (12:9d:74:ee:f8:75), Dst: 12:be:ae:14:b6:c8 (12:be:ae:14:b6:c8)
Internet Protocol Version 4, Src: 10.124.9.246 (10.124.9.246), Dst: 10.124.9.245 (10.124.9.245)
Transmission Control Protocol, Src Port: wsman (5985), Dst Port: 56648 (56648), Seq: 1, Ack: 193, Len: 191
Hypertext Transfer Protocol

No.     Time        Source                Destination           Protocol Length Info
      7 0.001594    10.124.9.245          10.124.9.246          TCP      66     56648 > wsman [FIN, ACK] Seq=1513 Ack=193 Win=30336 Len=0 TSval=86219230 TSecr=23667722

Frame 7: 66 bytes on wire (528 bits), 66 bytes captured (528 bits)
Ethernet II, Src: 12:be:ae:14:b6:c8 (12:be:ae:14:b6:c8), Dst: 12:9d:74:ee:f8:75 (12:9d:74:ee:f8:75)
Internet Protocol Version 4, Src: 10.124.9.245 (10.124.9.245), Dst: 10.124.9.246 (10.124.9.246)
Transmission Control Protocol, Src Port: 56648 (56648), Dst Port: wsman (5985), Seq: 1513, Ack: 193, Len: 0

No.     Time        Source                Destination           Protocol Length Info
      8 0.001944    10.124.9.246          10.124.9.245          TCP      66     wsman > 56648 [ACK] Seq=193 Ack=1514 Win=65280 Len=0 TSval=23667722 TSecr=86219230

Frame 8: 66 bytes on wire (528 bits), 66 bytes captured (528 bits)
Ethernet II, Src: 12:9d:74:ee:f8:75 (12:9d:74:ee:f8:75), Dst: 12:be:ae:14:b6:c8 (12:be:ae:14:b6:c8)
Internet Protocol Version 4, Src: 10.124.9.246 (10.124.9.246), Dst: 10.124.9.245 (10.124.9.245)
Transmission Control Protocol, Src Port: wsman (5985), Dst Port: 56648 (56648), Seq: 193, Ack: 1514, Len: 0
